### Heroes Of Pymoli Data Analysis
* Of the 1163 active players, the vast majority are male (84%). There also exists, a smaller, but notable proportion of female players (14%).

* Our peak age demographic falls between 20-24 (44.8%) with secondary groups falling between 15-19 (18.60%) and 25-29 (13.4%).  
-----

### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [4]:
# Dependencies and Setup
import pandas as pd

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)

## Player Count

* Display the total number of players

In [13]:
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [196]:

#find the unique values in SN that are the player id
players=purchase_data["SN"].unique()
players=pd.DataFrame(players)
play = players.count()
players= pd.DataFrame({"Total Players":[play]})
players

           Total Players
0  0    576
dtype: int64

   Total Players
0            576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [41]:
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [91]:
#Get the unique Items 
unique_items=purchase_data["Item ID"].value_counts()
unique_items=unique_items.count()
unique_items

numpy.int32

In [100]:
#Get Average Price 
Average_price=purchase_data["Price"].mean()

Average_price

3.050987179487176

In [85]:
#Get the number of purchases 
Purchase_number=purchase_data["Purchase ID"].count()

780

In [105]:
#Get the total Revenue
Total_revenue=purchase_data["Price"].sum()

In [373]:
#Build the summary table
summary_table=pd.DataFrame({
    "Number of unique items":[unique_items],
    "Average Price":[Average_price],
    "Number of pruchases":[Purchase_number],
    "Total Revenue": [Total_revenue]
})
#Apply format 
summary_table=summary_table.style.format({"Average Price" : "${:20,.2f}","Total Revenue":"${:20,.2f}"})
summary_table

   Number of Unique Items Average Price Number of Purchases Total Revenue
0                     179         $3.05                 780     $2,379.77

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [111]:
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [415]:
#Get the data frame with the percentage of people by gender 
gender_percentage=pd.DataFrame(purchase_data["Gender"].value_counts())
gender_percentage=gender_percentage.rename(columns={"Gender":"Total Count"})
gender_percentage

                       Total Count
Male                           652
Female                         113
Other / Non-Disclosed           15

In [416]:
#Calculate the percentage by type

gender_percentage["Percentage of players"]=(gender_percentage["Total Count"]/gender_percentage["Total Count"].sum())*100
gender_percentage=gender_percentage.style.format({"Percentage of players":"{:0,.2f} %"})
gender_percentage

                       Total Count Percentage of Players
Male                           484                84.03%
Female                          81                14.06%
Other / Non-Disclosed           11                 1.91%


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [120]:
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [214]:
#Group values by gender
purchase_data_grouped=purchase_data.groupby(['Gender'])
purchase_data_grouped.count().head()

                       Purchase ID   SN  Age  Item ID  Item Name  Price
Gender
Female                         113  113  113      113        113    113
Male                           652  652  652      652        652    652
Other / Non-Disclosed           15   15   15       15         15     15

In [223]:
#Extract only the values from gender
gender_sum = pd.DataFrame(purchase_data_grouped["Purchase ID"].count())
gender_sum

                       Purchase ID
Gender
Female                         113
Male                           652
Other / Non-Disclosed           15

In [232]:
#Extract Average of values
gender_price_mean = pd.DataFrame(purchase_data_grouped["Price"].mean())
gender_price_mean

                          Price
Gender
Female                 3.203009
Male                   3.017853
Other / Non-Disclosed  3.346000

In [233]:
#Extract Total purchase per Person
gender_mean_price = pd.DataFrame(purchase_data_grouped["Price"].sum())
gender_mean_price

                         Price
Gender
Female                  361.94
Male                   1967.64
Other / Non-Disclosed    50.19

In [240]:
#Group the values by gender and person 
total_purchase_df = purchase_data.groupby(['Gender','SN'])
#Sum the values of purchase 
total_purchase_df = pd.DataFrame(total_purchase_df["Price"].sum())
#Regroup values by gender 
total_purchase_df = total_purchase_df .groupby(['Gender'])
#Extract mean by values 
total_purchase_df = pd.DataFrame(total_purchase_df["Price"].mean())
total_purchase_df

                          Price
Gender
Female                 4.468395
Male                   4.065372
Other / Non-Disclosed  4.562727

In [370]:
merge_df=pd.merge(gender_sum, gender_price_mean, on = "Gender", how = "outer")
merge_df=pd.merge(merge_df,gender_mean_price, on ="Gender", how = "outer")
merge_df=pd.merge(merge_df,total_purchase_df, on ="Gender", how = "outer")
merge_df

                       Purchase ID   Price_x  Price_y     Price
Gender
Female                         113  3.203009   361.94  4.468395
Male                           652  3.017853  1967.64  4.065372
Other / Non-Disclosed           15  3.346000    50.19  4.562727

In [371]:
merge_df=merge_df.rename(columns={"Purchase ID":"Purchase Count","Price_x":"Average Purchase Price","Price_y":"Total Purchase Value","Price":"Avg Total Purchase per Person"})
merge_df=merge_df.style.format({"Average Purchase Price":"${:20,.2f}","Total Purchase Value":"${:20,.2f}","Avg Total Purchase per Person":"${:20,.2f}"})
merge_df

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,$3.20,$361.94,$4.47
Male,652,$3.02,"$1,967.64",$4.07
Other / Non-Disclosed,15,$3.35,$50.19,$4.56

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

       Total Count Percentage of Players
<10             17                 2.95%
10-14           22                 3.82%
15-19          107                18.58%
20-24          258                44.79%
25-29           77                13.37%
30-34           52                 9.03%
35-39           31                 5.38%
40+             12                 2.08%

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Age Ranges,,,,
<10,23,$3.35,$77.13,$4.54
10-14,28,$2.96,$82.78,$3.76
15-19,136,$3.04,$412.89,$3.86
20-24,365,$3.05,"$1,114.06",$4.32
25-29,101,$2.90,$293.00,$3.81
30-34,73,$2.93,$214.00,$4.12
35-39,41,$3.60,$147.67,$4.76
40+,13,$2.94,$38.24,$3.19

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

             Purchase Count Average Purchase Price Total Purchase Value
SN
Lisosia93                 5                  $3.79               $18.96
Idastidru52               4                  $3.86               $15.45
Chamjask73                3                  $4.61               $13.83
Iral74                    4                  $3.40               $13.62
Iskadarya95               3                  $4.37               $13.10

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,$4.61,$59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
145,Fiery Glass Crusader,9,$4.58,$41.22
132,Persuasion,9,$3.22,$28.99
108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,$4.61,$59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
82,Nirvana,9,$4.90,$44.10
145,Fiery Glass Crusader,9,$4.58,$41.22
103,Singed Scalpel,8,$4.35,$34.80